Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ།
en: At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདི་པད་མའི་སྙིང་པོའི་མདོག་འདྲ་བས་ན་དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་པད་མའི་མདོག་ཅན་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since this child has a complexion like the color of the center of a lotus, his name will be Lotus Color.”

source: དེ་ནས་ཁྱེའུ་པད་མའི་མདོག་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Lotus Color on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་། ཤོད་དགོད་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: As he grew up, he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: ཡི་གེ་མཁས་པ་དང་། ཀློག་མཁས་པ་དང་། མཛངས་པ་དང་། བྱ་བ་ལ་གསལ་བ་དང་། ཡིད་གཞུངས་པ་དང་། བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: He became skilled in writing, skilled at reading, learned, decisive, and industrious, a master of the eight types of examination.

source: ཁྱིམ་བདག་དེའི་གཉེན་ནི་ཚེ་དང་ལྡན་པ་ཉེ་སྡེ་ཡིན་ཏེ། ཁྱེའུ་པད་མའི་མདོག་གིས་དེ་ལ་བརྟེན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ།
en: Venerable Upasena was one of the householder’s relatives, and with his support, young Lotus Color found faith in the doctrine of the Blessed One.

source: དེས་ཕ་མ་ལ་གསོལ་ནས་ཚེ་དང་ལྡན་པ་ཉེ་སྡེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ་བསྙེན་པར་རྫོགས་སོ། །
en: He asked for his parents’ permission, went forth as a novice, and received full ordination in the presence of Venerable Upasena.

source: དེ་ནས་དེ་ཕྱི་ཞིག་ན་དེ་མཁན་པོ་ལ་མ་ཞུས་པར་དོན་ཞིག་ལ་རི་ཁྲོད་དེ་ནས་སོང་ནས།
en: One day he left his mountainside hermitage on an errand without notifying his preceptor.

source: དེ་མཐར་གྱིས་ལྗོངས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས་ཡུལ་བཅོམ་བརླག་ཅེས་བྱ་བར་ཕྱིན་ཏེ། བཅོམ་བརླག་ན་བོང་བུའི་ཀུན་དགའ་ར་བ་ན་གནས་སོ། །
en: He made his way through the countryside and eventually arrived in Mathurā, where he stayed at Donkey Grove.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས། ཡུལ་བཅོམ་བརླག་ཏུ་བསོད་སྙོམས་ལ་སོང་བ་དང་།
en: Then Venerable Lotus Color donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in Mathurā.

source: ཚེ་དང་ལྡན་པ་དེ་སྤྱོད་ཡུལ་གྱི་རྒྱུས་མི་ཤེས་བཞིན་དུ་མཐར་གྱིས་བསོད་སྙོམས་བྱེད་པ་ལས་སྨད་འཚོང་མའི་ཁྱིམ་དུ་སོང་ངོ་། །
en: Being unfamiliar with the area, he eventually came to the house of a sex worker while going for alms.

source: སྨད་འཚོང་མ་དེ་ཡང་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་པ་མཛེས་པ་རོ་རྩ་ལ་གཡེམ་པ་ཞིག་གོ། །
en: The sex worker was well proportioned, pleasing to the eye, beautiful, and alluring.

source: དེ་ནས་བུད་མེད་དེས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་རྒྱང་ནས་མཐོང་ངོ་། །
en: She saw Venerable Lotus Color in the distance, and an arrow of lust shot through her.

source: མཐོང་ནས་ཀྱང་འདོད་ཆགས་ཀྱི་མདའ་དྲག་པོས་ཕོག་སྟེ། དེ་འདོད་ཆགས་ཀྱི་དབང་དུ་གྱུར་ནས་ཚམ་ཚོམ་མེད་པར་ལངས་ཏེ་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་སྨྲས་པ།
en: Compelled by lust, she rose without delay, went up to Venerable Lotus Color, and said,

source: འཕགས་པ་གདན་བཤམས་པ་འདི་ལ་བཞུགས་སུ་གསོལ།
en: “Noble one, please have a seat on this cushion.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་བསམས་པ།
en: And as Venerable Lotus Color sat on the seat, wondering,

source: ཅི་འདི་དགེ་བསྙེན་མ་ཅིག་ཡིན་ནམ་སྙམ་ནས་
en: “Who is this lay vow holder?”

source: སྟན་བཤམས་པ་དེ་ལ་འདུག་པ་དང་། བུད་མེད་དེས་འདོད་ཆགས་ཀྱི་ཤུགས་ཀྱིས་མི་བཟོད་ཆེས་ནས་པད་མའི་མདོག་ལ་སྨྲས་པ།
en: the intensity of her lust grew too much for her to bear, and she said to him,

source: བཙུན་པ་ཁྱོད་ཀྱང་གཟུགས་དང་ལང་ཚོ་ཕུན་སུམ་ཚོགས་པ་ལགས་ལ། བདག་ཀྱང་ཡན་ལག་ཐམས་ཅད་སྡུག་པ་ལགས་ཀྱིས་བདག་དང་གཟིམས་པར་གསོལ་ཞེས་བྱས་སོ། །
en: “Lord, your young body is in full bloom, and every inch of me is so enticing. Sleep with me.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་རྣ་བ་གཉིས་བཀག་སྟེ་འདུག་ནས།
en: As soon as she said this Venerable Lotus Color covered his ears with his hands and said,

source: བདག་ནི་སྡིག་པ་འདི་ལྟ་བུ་མི་བྱེད་དེ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ཉམས་པར་བྱེད་མི་ཕོད་དོ་ཞེས་བྱས་སོ། །
en: “To commit such a sin would be to forsake all the Buddha has taught us. I could not bear it.”

source: བུད་མེད་དེས་སྨྲས་པ། གནོད་ཅང་འདི་ལྟ་བུ་ཅི་འཚལ་གལ་ཏེ་ཁྱོད་འདོད་པ་རྣམས་མི་བཞེད་ན་སྨད་འཚོང་མའི་ཁྱིམ་དུ་བྱོན་ཏེ་ཅི་བགྱི།
en: “How dare you spurn me like this!” the woman said. “Why have you come to the house of a sex worker, if not to indulge your desires?”

source: པད་མའི་མདོག་གིས་སྨྲས་པ། བདག་གསར་དུ་འོངས་པས་སྤྱོད་ཡུལ་གྱི་རྒྱུས་མི་ཤེས་ཏེ་
en: “I’m new here,” Venerable Lotus Color replied, “and I’m not familiar with the area.

source: དེའི་ཕྱིར་འདིར་འོངས་པར་ཟད་ཀྱི་བདག་ནི་འདོད་པ་རྣམས་དོན་དུ་གཉེར་བ་མ་ཡིན་ཏེ་
en: That’s why I ended up here. I’m not chasing after desires.

source: བདག་གིས་བྱ་བ་མ་ཡིན་པ་འདི་ལྟར་བྱར་མི་རུང་ངོ་། །
en: It wouldn’t be right for me to do such a thing.”

source: མོས་སྨྲས་པ། ཁྱོད་མི་བཞེད་ན་ཡང་བདག་གིས་ཁྱོད་མཐུ་ཀར་བོར་ཏེ་ཉལ་དུ་གཞུག་གོ། །
en: “If you refuse me, I shall put a spell on you,” she said. “Come to bed.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་དངངས་ནས་སྟན་ལས་ལངས་ཏེ། ཕྱིར་བྱུང་ནས་བསོད་སྙོམས་མ་བྱས་པར་གཙུག་ལག་ཁང་དུ་སོང་ངོ་། །
en: At this, Venerable Lotus Color rose from his seat in fear and returned to the monastery without taking alms.

source: དེའི་ཕྱིར་བྱུང་སྟེ་སོང་ནས་སྨད་འཚོང་མ་དེ་འདོད་ཆགས་ཀྱི་མེས་ཡོངས་སུ་གདུངས་ཏེ། རིགས་ངན་མོ་སྔགས་ཀྱི་མཐུ་ཡོད་པ་ཞིག་བཀུག་ནས་
en: After all this had taken place and he was gone, the sex worker, searing with lust, sent for a woman of lower caste who had the power to cast spells.

source: དེ་ལ་གཏམ་དེ་རྒྱས་པར་བསྙད་དེ་སྨྲས་པ། བདག་དགེ་སློང་དེ་དང་ཕྲད་པར་གྱིས་ཤིག་དང་བདག་གིས་ཁྱོད་ལ་གསེར་མང་དུ་སྦྱིན་ནོ་ཞེས་བྱས་སོ། །
en: She told her the story in detail and then said, “Bring me together with that monk, and I shall give you a great deal of gold.”

source: དེ་ནས་དེས་དེ་ལྟར་བགྱིའོ་ཞེས་སྨྲས་ནས།
en: “As you wish,” she replied.

source: རིགས་ངན་མོ་དེས་བུད་མེད་དེ་རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་ཏེ་ཁྱིམ་དེ་ལྷ་ཁང་བཞིན་དུ་བྱས་ཏེ་བཞག་ནས། དཀྱིལ་འཁོར་བ་ལང་གི་ལྕི་བས་བྱུགས་ཏེ་
en: Then the woman of lower caste adorned herself, and once she had set up the house as a kind of temple, she spread a circle of cow dung on the floor.

source: བདུག་སྤོས་དང་མེ་ཏོག་དང་ལྷ་བཤོས་ཀྱི་ཆོ་ག་རྣམས་བཤམས་ནས་མེ་སྦར་ཏེ་ཡུངས་ཀར་ལ་སྔགས་ཀྱིས་བཏབ་ཅིང་མེའི་ནང་དུ་འདེབས་སོ། །
en: After setting forth the ritual incense, flowers, and food, she lit a fire, cast a mantra onto white mustard seeds, and tossed them into the flames.

source: ཚེ་དང་ལྡན་པ་དེ་ཡང་སྔགས་ཀྱི་མཐུས་དྲངས་ནས་ཕྱིར་སྨད་འཚོང་མའི་ཁྱིམ་དེ་ཉིད་དུ་འོངས་སོ། །
en: The venerable monk returned to the house of the sex worker, drawn there by the power of the mantra.

source: དེ་ནས་རིགས་ངན་མོ་དེས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་ཁྱིམ་དེར་འོངས་པར་མཐོང་ངོ་། །
en: When the woman of lower caste saw that Venerable Lotus Color had come to the house,

source: མཐོང་ནས་སྨྲས་པ།
en: she looked at him and said,

source: བཙུན་པ་ཁྱོད་ཁྱིམ་འདིར་འོངས་པ་ལ་བྱ་བ་གཉིས་ཡོད་དེ་ཡང་ན་ནི་སྨད་འཚོང་མ་འདི་དང་ལྷན་ཅིག་ཏུ་ཉོལ་ཅིག །
en: “Lord, now that you have returned to this house, you have but two choices. Sleep with this sex worker,

source: ཡང་ན་ནི་མེ་འདིའི་ནང་དུ་མཆོངས་ཤིག་ཅེས་བྱས་སོ། །
en: or leap into the fire!”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་བསམས་པ།
en: When he heard this, Venerable Lotus Color thought,

source: དེ་བཞིན་གཤེགས་པ་ནི་འཇིག་རྟེན་དུ་བརྒྱ་ལམ་བརྒྱ་ལམ་ན་འབྱུང་བར་ཟད་དེ་དཔེར་ན་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་དང་འདྲ་ལ།
en: “If the Tathāgata’s appearance in this world is so rare it can be likened only to the udumbara flower,

source: མིར་སྐྱེ་བ་འཐོབ་པ་དང་ཡུལ་དབུས་སུ་སྐྱེ་བ་ཡང་རྙེད་པར་དཀའ་བས་ན།
en: and if birth as a human in a central land is also difficult to achieve,

source: མེའི་ནང་དུ་མཆོང་བ་ནི་ལེགས་པ་ཡིན་གྱིས་འདི་དང་ཕྲད་པར་བྱ་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ་སྙམ་དུ་བསམས་ནས།
en: then it’s better for me to jump into the fire than to be with this woman.”

source: གོས་རྣམས་ཕུད་དེ་རིགས་ངན་མོ་ལ་གཏད་ནས་སྨྲས་པ།
en: With this thought he took off his garments and handed them to the woman of lower caste, saying,

source: ཆེ་ཞེ་གོས་འདི་རྣམས་གཙུག་ལག་ཁང་དུ་ཁྱེར་ལ་བདག་གི་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཕུལ་ཅིག །
en: “Elder sister, take these garments to the monastery and offer them to my fellow practitioners of the holy life.”

source: རིགས་ངན་མོས་སྨྲས་པ། བཙུན་པ་ཁྱོད་ཅི་བྱེད།
en: “Venerable One, what are you doing?” the woman of lower caste asked.

source: པད་མའི་མདོག་གིས་སྨྲས་པ། མེའི་ནང་དུ་མཆོང་བར་ཆད་དོ། །
en: “Jumping into the fire,” Venerable Lotus Color replied.

source: དེས་དེའི་ཚིག་དེ་ཐོས་ནས་རིགས་ངན་མོ་མི་དགའ་བར་གྱུར་ཏེ་བསམས་པ།
en: When she heard his words, the woman of lower caste was distraught, and thought,

source: ཀྱེ་མ་བདག་དབུལ་བས་བདག་གིས་འདི་ལྟ་བུའི་ཡོན་གནས་དག་ལ་ཉེས་པ་བྱེད་ཅིང་འདུག་སྟེ་
en: “Alas, because of my poverty all I do is cause trouble for those worthy of offerings like him.

source: བདག་གིས་འདི་ལྟ་བུའི་སེམས་ཅན་དག་པ་མི་དགའ་བར་བྱ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་ནོ་སྙམ་ནས
en: It’s not my place to make such beings unhappy.”

source: དེས་ཆོ་ག་ཐམས་ཅད་བཏང་སྟེ་གུས་པར་བསྒྲིམ་པས་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སེམས་ཅན་དག་པ་བཟོད་པར་གསོལ།
en: With this thought, she gave up performing all those rituals and prostrated herself at his feet with the greatest respect, saying, “Pure being, please forgive me!

source: བདག་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལག་ནས་དྲང་བར་གསོལ།
en: I am mired in misdeeds! Please reach down and lift me up!”

source: པད་མའི་མདོག་གིས་སྨྲས་པ་ངས་ནི་བཟོད་ན་ཁྱོད་བདག་གི་ལས་རྣམས་ཀྱིས་མི་བཟོད་དོ། །
en: “I forgive you,” Venerable Lotus Color said. “But you will not be forgiven by your actions.”

source: དེ་ནས་སྨད་འཚོང་མ་དེ་ཡང་མཐོང་མ་ཐག་ཏུ་འདོད་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས་དེ་ལ་དགའ་བ་སྐྱེས་སོ། །
en: Seeing all this, the sex worker’s lust suddenly gave way, and she felt joy toward him.

source: དགའ་བ་སྐྱེས་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: Full of such joy she prostrated herself at his feet and said,

source: སྐལ་བ་ཆེན་པོ་དང་ལྡན་པ་བདག་འདོད་པའི་འདོད་ཆགས་ཀྱི་དབང་དུ་གྱུར་པས་ཁྱོད་མི་དགྱེས་པར་བགྱིས་པ་བཟོད་པར་གསོལ་ཞེས་སྨྲས་ནས
en: “Fortunate One, driven by my lust I’ve caused you such unhappiness. Please forgive me.”

source: བུ་མོ་སྨད་འཚོང་མ་དེ་དང་རིགས་ངན་མོ་དེ་གཉིས་ཆོས་མཉན་པའི་ཕྱིར་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གི་མདུན་དུ་འདུག་གོ། །
en: The young sex worker and the woman of lower caste both sat down in front of Venerable Lotus Color to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་དེ་གཉིས་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ནས། དེ་གཉིས་ཀྱིས་སྟན་དེ་ལ་འདུག་བཞིན་དུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Venerable Lotus Color taught them the Dharma particularly suited to them, and they manifested the resultant state of stream entry right where they sat.

source: དེ་གཉིས་ཀྱིས་བདེན་པ་མཐོང་ནས་སྨྲས་པ།
en: Having seen the truths, they requested,

source: བཙུན་པ་བདག་ཅག་གཉིས་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན
en: “Lord, if permitted we wish to go forth in Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: བདག་ཅག་གཉིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ། །
en: In the presence of the Blessed One, we too wish to practice the holy life.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་དེ་གཉིས་དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་ཁྲིད་དེ།
en: Venerable Lotus Color brought them to the nunnery and presented them to the nuns.

source: དགེ་སློང་མ་རྣམས་ལ་གཏད་ནས་དགེ་སློང་མ་རྣམས་ཀྱིས་དེ་གཉིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་བྱས་ནས། དེ་གཉིས་ལ་ལུང་ཡང་ཕོག་གོ། །
en: The nuns led them to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་གཉིས་ཀྱིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་གཉིས་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས་གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་། རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: They had no regard for worldly profit, passion, or acclaim. They became objects of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: འདི་ལྟར་བདག་གིས་གཞན་གྱི་རྒྱུད་ནི་དག་པར་བྱེད་ནུས་ན་བདག་གི་རྒྱུད་དག་པར་བྱེད་མ་ནུས་སོ། །
en: “So far, I’ve been able to purify the mindstreams of others, but not my own mindstream.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་མང་དུ་ཐོས་པ་ལ་ཕན་ཡོན་རྣམ་པ་ལྔ་ཡོད་དེ།
en: The Blessed One tells us, ‘Studying well has five benefits for those who undertake it:

source: ཕུང་པོ་ལ་མཁས་པ་དང་ཁམས་ལ་མཁས་པ་དང་སྐྱེ་མཆེད་ལ་མཁས་པ་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་དང་།
en: knowledge of the aggregates, knowledge of the elements, knowledge of the sense bases, knowledge of dependent arising,

source: གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་པར་འགྱུར་རོ་ཞེས་གསུངས་ཀྱིས།
en: and knowledge of the proper and the improper.’

source: བདག་གིས་ཀྱང་ཉོན་མོངས་པ་ཟད་པར་བྱ་བའི་ཕྱིར་བརྩམ་པར་བྱའོ་སྙམ་ནས
en: Thus, I too must strive to eliminate afflictive emotions.”

source: དེས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: With this thought, he cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས་གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As an arhat, free from the attachments of the three realms, his mind regarded gold no differently than filth, and the palms of his hands as like space itself.

source: དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་ཡུལ་བཅོམ་བརླག་ཏུ་ཇི་སྲིད་དགའ་བའི་བར་དུ་འདུག་འདུག་ནས་མཉན་དུ་ཡོད་པར་སོང་ངོ་། །
en: After achieving arhatship and staying long enough in Mathurā, he traveled to Śrāvastī.

source: དེ་དེར་སོང་ནས་གཏམ་དེ་རྒྱས་པར་དགེ་སློང་རྣམས་ལ་བསྙད་དོ། །
en: When he got there, he told the story in detail to the monks.

source: བཙུན་པ་བུ་མོ་སྨད་འཚོང་མ་འདོད་པའི་འདོད་ཆགས་ཀྱི་དབང་དུ་གྱུར་པས། ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་ཇི་ལྟར་མི་དགའ་བར་བགྱིས་པ་དང་སླར་དེ་ཉིད་ལ་བརྟེན་ནས་རབ་ཏུ་བྱུང་སྟེཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: “Lord, tell us why this young sex worker was driven by her lust to make Venerable Lotus Color unhappy, but then with his support went forth, cast away all afflictive emotions, and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ནི་ཚེ་རབས་ལྔ་བརྒྱའི་བར་དུ་འདིའི་ཆུང་མར་གྱུར་ཏེ།
en: “For five hundred lifetimes this young woman was his wife,” the Blessed One explained.

source: དེའི་སྔོན་གྱི་བག་ཆགས་ཀྱི་གཞི་ཡོད་པས་ན་མཐོང་མ་ཐག་ཏུ་ཀུན་ཏུ་ཆགས་པར་གྱུར་ཏོ། །
en: “It was on the basis of her previous habitual tendencies that she fell in love with him at first sight.”

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་པད་མའི་མདོག་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ། བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: “Lord, what action did Venerable Lotus Color take that ripened into his birth into a family of great means, prosperity, and wealth, and that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: བཙུན་པ་འདིས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་ལས་ཆུང་མ་གཉིས་ཡོད་དོ། །
en: there lived a certain householder in Vārāṇasī who had two wives.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་ དེས་ཆུང་མ་གཉིས་ལ་སྨྲས་པ།
en: “One day the householder found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa, and told his wives,

source: བཟང་མོ་གཉིས་ང་ནི། བཅོམ་ལྡན་འདས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་དུ་འགྲོ།
en: ‘My dears, I am going to go forth in the doctrine of the Buddha Kāśyapa.

source: བག་དང་ལྡན་པར་ཁྱིམ་ན་གནས་པར་གྱིས་ཤིག །
en: You should continue with your duties at home.’

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ། ཇོ་བོ་གལ་ཏེ་དེ་ལྟ་ན་བདག་ཅག་གཉིས་ཀྱང་ཇོ་བོ་རབ་ཏུ་འབྱུང་བའི་སླད་བཞིན་དུ་རབ་ཏུ་འབྱུང་བར་འཚལ་ལོ། །
en: “ ‘Lord, if you are going to go forth, then afterward we will go forth too,’ they said.

source: ཁྱིམ་བདག་དེས་སྨྲས་པ།
en: “The householder replied,

source: གལ་ཏེ་ཁྱེད་གཉིས་ཀྱང་རབ་ཏུ་འབྱུང་བར་འདོད་ན་ཁྱེད་གཉིས་ཇེ་རབ་ཏུ་འབྱུང་བར་གྱིས་ཤིག་དང་དེའི་འོག་ཏུ་ང་རབ་ཏུ་འབྱུང་བར་བྱའོ་ཞེས་
en: ‘If you also wish to go forth, then let you two go forth first, and I shall go forth after you.’

source: དེ་སྐད་སྨྲས་ནསཁྱིམ་བདག་དེས་ཆུང་མ་དེ་གཉིས་དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་ཁྲིད་དེ་དགེ་སློང་མ་རྣམས་ལ་གཏད་དོ། །
en: Having said this, the householder brought both his wives to the nunnery and presented them to the nuns.

source: དགེ་སློང་མ་རྣམས་ཀྱིས་ཀྱང་དེ་གཉིས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་སོ། །
en: “The nuns led them to go forth as novices and conferred on them full ordination.

source: དེ་གཉིས་རབ་ཏུ་བྱུང་ནས་ཁྱིམ་བདག་དེ་ཡང་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས། བཅོམ་ལྡན་འདས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: After they had gone forth, the householder gave gifts, made merit, and went forth in the doctrine of the Buddha Kāśyapa.

source: དེ་རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ། རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བ།
en: Once he had gone forth, he studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of his wisdom and freedom.

source: གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ཏོ། །
en: He acquired provisions of clothing, food, bedding, a seat, and medicines for the sick.

source: དགེ་སློང་མ་དེ་གཉིས་ནི་རབ་ཏུ་བྱུང་ནས། འཐབ་ཀྲོལ་ཅན་ཁ་ཚས་ངན་པར་གྱུར་ཏེ།
en: “After their going forth, the two women became quarrelsome and abusive.

source: དེ་གཉིས་ལས་གཅིག་གིས་ནི་དགེ་སློང་མ་རྣམས་ལ་རིགས་ངན་མོ་ཞེས་བྱ་བའི་ཚིག་སྨྲས་སོ། །
en: One of them called out to the other nuns, ‘You untouchables!’

source: གཅིག་གིས་ནི་སྨད་འཚོང་མ་ཞེས་བྱ་བའི་ཚིག་སྨྲས་སོ། །
en: and the other shouted ‘You whores!’ at them.

source: དེ་ནས་དགེ་སློང་དེས་དེ་གཉིས་འཐབ་ཀྲོལ་ཅན་དུ་གྱུར་པ་དེ་ལས་བཀག་ནས། སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་བྱེད་པ་ལ་བཙུད་དོ། །
en: The monk soon put a stop to the nuns being so quarrelsome, and he inspired them to give gifts and to share what they had.

source: དེ་ནས་ཕྱིས་དགེ་སློང་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ཏེ། དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་དག་ལ་ཡང་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པ།
en: “After he had offered food to the Blessed Kāśyapa and the rest of the saṅgha of monks, he venerated the stūpas containing hair and nail relics, and prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་ཡང་གྱུར་ཅིག །
en: May I be well proportioned, pleasing to the eye, and beautiful.

source: དེ་ནས་དགེ་སློང་མ་དེ་གཉིས་ཀྱིས་དེ་མཐོང་ནས་འཕགས་པ་ཁྱོད་ཀྱིས་སྨོན་ལམ་ཇི་ལྟ་བུ་ཅིག་བཏབ་ཅེས་དྲིས་སོ། །
en: “When the two nuns saw him sitting there praying, they asked him, ‘Noble one, what kind of prayers are you making?’

source: དེས་ཀྱང་དེ་གཉིས་ལ་རྒྱས་པར་བསྙད་ནས། དེ་གཉིས་ཀྱིས་ཀྱང་དེ་ཐོས་ནས་སྨོན་ལམ་བཏབ་པ།
en: He told them in detail, and after they listened, they prayed in the same way:

source: བདག་ཅག་གཉིས་ཀྱིས་ཀྱང་འཕགས་པ་ཁྱོད་ཉིད་ལས་བརྟེན་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘With your support, noble one, may we too please and not displease the Blessed Buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག །
en: May we go forth in only his doctrine, cast away all afflictive emotions, and manifest arhatship.

source: བདག་ཅག་གཉིས་ཀྱིས་དགེ་སློང་མ་མང་པོ་ཞིག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པའི་སྐལ་བ་ཅན་དུ་བདག་ཅག་གཉིས་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May we not meet with the results of the act of speaking harshly to the group of nuns.’

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་པད་མའི་མདོག་འདི་ཉིད་ཡིན་ནོ། །
en: The one who was that monk then is none other than Lotus Color.

source: དེའི་ཚེ་དགེ་སློང་མ་གཉིས་སུ་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་དགེ་སློང་མ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: Those who were those two nuns then are none other than these two nuns now.

source: དགེ་སློང་དེས་དེར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་བདུན་བཤོས་གསོལ་ཏེ།
en: The monk’s acts at that time of making offerings to the Buddha and the rest of the saṅgha of monks,

source: དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་རྣམས་ལ་བཀུར་སྟི་བྱས་ནས།
en: venerating the stūpas containing hair and nail relics,

source: སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: and praying thus ripened into his birth into a family of great means, prosperity, and wealth.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དགེ་སློང་མ་དེ་གཉིས་ཀྱིས་དེར་སྨོན་ལམ་བཏབ་སྟེ།
en: “Monks, at that time the two nuns prayed,

source: བདག་ཅག་གཉིས་ཀྱིས་འདི་ཉིད་ལ་བརྟེན་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །
en: ‘With your support, noble one, may we too please and not displease the Blessed Buddha.

source: མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་
en: May we go forth in only his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: འདི་གཉིས་ཀྱིས་འདི་ལས་བརྟེན་ནས་ད་ལྟར་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: “So it is that with his support these two have pleased and not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེ་གཉིས་ཀྱིས་དེར་དགེ་སློང་མ་མང་པོ་ཞིག་ལ་གཅིག་གིས་ནི་རིགས་ངན་མོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་ལ། གཅིག་གིས་ནི་སྨད་འཚོང་མ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གཅིག་རིགས་ངན་མོའི་རིགས་སུ་སྐྱེས་ལ་གཅིག་ནི་སྨད་འཚོང་མར་གྱུར་ཏོ། །
en: But one of them called out to the nuns, ‘You untouchables!’ and the other shouted, ‘You whores!’ so those actions ripened such that one was born into a family of lower caste, and the other became a sex worker.”
